{
  "quotes": [
    {
      "who": "Dr. Valentine Pilman",
      "quote": "The hypothesis of God, for instance, gives an incomparably absolute opportunity to understand everything and know absolutely nothing. Give man an extremely simplified system of the world and explain every phenomenon away on the basis of that system. An approach like that doesn't require any knowledge. Just a few memorized formulas plus so-called intuition and so-called common sense.",
      "source": "Roadside Picnic",
      "author": "Arkady Strugatsky, Boris Strugatsky",
      "tags": ["god", "science", "skepticism"]
    },
    {
      "quote": "[I]t isn't difficult to dissociate one's feelings from a mere printed litany of frightfulness. It's easy to convince oneself that things can't really be that terrible, that the horror I allude to is being overblown, that what is going on elsewhere in space-time is somehow less real than the here-and-now, or that the good in the world somehow offsets the bad. Yet however vividly one thinks one can imagine what agony, torture or suicidal despair must be like, the reality is inconceivably worse. The force of \"inconceivably\" is itself largely inconceivable here. Blurry images of Orwell's \"Room 101\" can barely even hint at what I'm talking about. Even if one's ancestral namesakes [aka \"younger self\"] underwent great pain, then the state-dependence of memories means that much of pain's sheer dreadfulness is semantically, cognitively and emotionally inaccessible in the here-and-now.",
      "source": "The Hedonistic Imperative",
      "author": "David Pearce",
      "tags": ["suffering", "horror", "psychedelic"]
    },
    {
      "quote": "It's not that there are no differences between human and non-human animals, any more than there are no differences between black people and white people, freeborn citizens and slaves, men and women, Jews and gentiles, gays or heterosexuals. The question is rather: are they morally relevant differences? This matters because morally catastrophic consequences can ensue when we latch on to a real but morally irrelevant difference between sentient beings.",
      "source": "The Abolitionist Project",
      "author": "David Pearce",
      "tags": ["ethics", "vegan", "discrimination", "antispeciesism"]
    },
    {
      "quote": "If possessing a higher degree of intelligence does not entitle one human to use another for his or her own ends, how can it entitle humans to exploit non-humans?",
      "source": "Animal Liberation",
      "author": "Peter Singer",
      "tags": ["ethics", "vegan", "discrimination", "antispeciesism"]
    },
    {
      "quote": "[B]oth natural selection and the historical record offer powerful reasons for doubting the trustworthiness of our naive moral intuitions. So the possibility that human civilisation might be founded upon some monstrous evil should be taken seriously - even if the possibility seems transparently absurd at the time.",
      "source": "The Antispeciesist Revolution",
      "author": "David Pearce",
      "tags": ["ethics", "vegan", "evolution", "history"]
    },
    {
      "quote": "When one is gripped by excruciating physical pain, one is always shocked at just how frightful it can be.",
      "source": "The Abolitionist Project",
      "author": "David Pearce",
      "tags": ["suffering", "pain", "psychedelic"]
    },
    {
      "quote": "[A marketing orientation in evolution] puts courtship at the heart of modern biology, as marketing is at the heart of modern business.",
      "source": "The Mating Mind: How Sexual Choice Shaped the Evolution of Human Nature",
      "author": "Geoffrey Miller",
      "tags": ["evolution", "science", "analogy", "animals"]
    },
    {
      "quote": "A computer cannot realise a solution of the Navier-Stokes equations in which the solution variables refer to atmospheric pressure, velocity, density etc. because a computer does not possess these quantities. A computer can only represent variables such as atmospheric pressure.",
      "source": "Universe creation on a computer",
      "author": "Gordon McCabe",
      "tags": ["AI", "computer science", "simulation"]
    },
    {
      "quote": "One should be wary of assuming that we're the folk who can properly look after ourselves, whereas our descendants, if they become genetically pre-programmed ecstatics, will get trapped in robot-serviced states of infantile dependence. For it shouldn't be forgotten that exuberantly happy people also have a fierce will to survive. They love life dearly. They take on daunting challenges against seemingly impossible odds. One of the hallmarks of many endogenous depressive states, on the other hand, is so-called behavioural despair. If one learns that apparently no amount of effort can rescue one from an aversive stimulus, then one tends to sink into a lethargic stupor. This syndrome of \"learned helplessness\" may persist even when the opportunity to escape from the nasty stimulus subsequently arises.",
      "source": "The Hedonistic Imperative",
      "author": "David Pearce",
      "tags": ["suffering", "transhumanism", "future"]
    },
    {
      "quote": "[A] good estimate is an estimate that provides a clear enough view of the project reality to allow the project leadership to make good decisions about how to control the project to hit its targets.",
      "source": "Software Estimation: Demystifying the Black Art",
      "author": "Steve McConnell",
      "tags": ["software engineering", "management", "business"]
    },
    {
      "quote": "A man generally has two reasons for doing a thing; one that sounds good, and a real one.",
      "author": "John Pierpont Morgan",
      "tags": ["rationalisation", "short"]
    },
    {
      "quote": "[A] recursive definition (when properly formulated) never leads to infinite regress or paradox. This is because a recursive definition never defines something in terms of itself, but always in terms of simpler versions of itself.",
      "source": "Gödel, Escher, Bach: An Eternal Golden Braid",
      "author": "Douglas Hofstadter",
      "tags": ["mathematics", "recursion", "paradox"]
    },
    {
      "quote": "[T]rue hedonic engineering, as distinct from mindless hedonism or reckless personal experimentation, can be profoundly good for our character. Character-building technologies can benefit utilitarians and non-utilitarians alike. Potentially, we can use a convergence of biotech, nanorobotics and information technology to gain control over our emotions and become better (post-)human beings, to cultivate the virtues, strength of character, decency, to become kinder, friendlier, more compassionate: to become the type of (post)human beings that we might aspire to be, but aren't, and biologically couldn't be, with the neural machinery of unenriched minds. Given our Darwinian biology, too many forms of admirable behaviour simply aren't rewarding enough for us to practise them consistently: our second-order desires to live better lives as better people are often feeble echoes of our baser passions.",
      "source": "Utopian Neuroscience",
      "author": "David Pearce",
      "tags": ["altruism", "transhumanism", "future", "paradise engineering"]
    },
    {
      "quote": "[M]en are only as good as their technical development allows them to be.",
      "source": "Charles Dickens",
      "author": "George Orwell",
      "tags": ["transhumanism", "technology", "nature"]
    },
    {
      "quote": "If liberty means anything at all, it means the right to tell people what they do not want to hear.",
      "source": "Animal Farm",
      "author": "George Orwell",
      "tags": ["liberty", "freedom", "offense", "short"]
    },
    {
      "quote": "We can interpret any piece of matter as being conscious if we want to, but in many cases it doesn't make sense to most of us to speak that way. Panpsychism is analogous to \"pantableism\" -- the view that tableness is intrinsic to all matter. There is some sense in which you can interpret any piece of matter as being a table. After all, for any (solid) clump of atoms, you can put stuff on it, and it can support the things that it holds. But this definition is really a stretch for most objects. So it is with saying that everything is conscious.",
      "source": "Dissolving Confusion about Consciousness",
      "author": "Brian Tomasik",
      "tags": ["consciousness", "panpsychism", "analogy"]
    },
    {
      "quote": "In a triumph of aestheticism over morality, many animal lovers otherwise sympathetic to the sentiments expressed here will doubtless be aghast at the very idea of losing such lovable companions and time-honoured killers as members of the cat family; but then they are unlikely to be hunted down in terror or physically eaten alive, which lends a rather different perspective to any issue at all.",
      "source": "The Taste Of Depravity",
      "author": "David Pearce",
      "tags": ["ethics", "nature", "cats", "predation", "suffering"]
    },
    {
      "who": "Richard Noonan",
      "quote": "[A] person needs money in order to never think about them.",
      "source": "Roadside Picnic",
      "author": "Arkady Strugatsky, Boris Strugatsky",
      "tags": ["money", "short"]
    },
    {
      "quote": "[I]nstead of trying to ensure that humanity survives, we should prioritize making the future less bad, in case it will contain sentient life.",
      "source": "How Could an Empty World Be Better than a Populated One?",
      "author": "Simon Knutsson",
      "tags": ["ethics", "future", "suffering", "s-risks", "x-risks"]
    },
    {
      "quote": "[T]here's no forces stopping us from making [the world] better, from fixing it; and the only thing stopping us is the fact that we don't have right ideas in people's [...] heads.",
      "source": "Knowledge, Intelligence, Wisdom....just do it.",
      "author": "inmendham",
      "tags": ["politics", "ideas"]
    },
    {
      "quote": "The question is not Can they reason?, nor Can they talk?, but Can they suffer?",
      "source": "An Introduction to the Principles of Morals and Legislation",
      "author": "Jeremy Bentham",
      "tags": ["suffering", "animals", "ethics"]
    },
    {
      "quote": "AI researchers have devoted little effort to passing the Turing Test, believing that it is more important to study the underlying principles of intelligence than to duplicate an exemplar. The quest for \"artificial flight\" succeeded when the Wright brothers and others stopped imitating birds and started using wind tunnels and learning about aerodynamics. Aeronautical engineering texts do not define the goal of their field as making \"machines that fly so exactly like pigeons that they can fool even other pigeons.\"",
      "source": "Artificial Intelligence: A Modern Approach",
      "author": "Stuart Russell, Peter Norvig",
      "tags": ["AI", "science", "analogy"]
    },
    {
      "quote": "[W]hat special competence does a priest, rabbi, or imam have to judge the ethical implications of embryonic stem-cell research, family planning, or preventative war? The truth is that a person’s knowledge of a scriptural tradition is no more relevant to ethics than it is to astronomy.",
      "source": "Letter to a Christian Nation",
      "author": "Sam Harris",
      "tags": ["religion", "ethics"]
    },
    {
      "quote": "Choosing beliefs freely is not what rational minds do.",
      "source": "The Moral Landscape: How Science Can Determine Human Values",
      "author": "Sam Harris",
      "tags": ["religion", "rationality", "skepticism", "short"]
    },
    {
      "quote": "Consciousness has to be something, and it's not any stranger for it to be certain physical operations than for it to be anything else.",
      "source": "Dissolving Confusion about Consciousness",
      "author": "Brian Tomasik",
      "tags": ["consciousness"]
    },
    {
      "quote": "Constraints are often advantages in disguise. Forget about venture capital, long release cycles, and quick hires. Instead, work with what you have.",
      "source": "Getting Real: The Smarter, Faster, Easier Way to Build a Web Application",
      "author": "37signals",
      "tags": ["advice", "startup", "business"]
    },
    {
      "quote": "Do not be too moral. You may cheat yourself out of much life so. Aim above morality. Be not simply good, be good for something.",
      "author": "Henry David Thoreau",
      "tags": ["utilitarianism", "ethics", "religion", "secularism"]
    }
  ]
}
