{
  "quotes": [
    {
      "who": "Dr. Valentine Pilman",
      "quote": "The hypothesis of God, for instance, gives an incomparably absolute opportunity to understand everything and know absolutely nothing. Give man an extremely simplified system of the world and explain every phenomenon away on the basis of that system. An approach like that doesn't require any knowledge. Just a few memorized formulas plus so-called intuition and so-called common sense.",
      "source": "Roadside Picnic",
      "author": "Arkady Strugatsky, Boris Strugatsky",
      "tags": ["god", "science", "skepticism", "atheism"]
    },
    {
      "quote": "[I]t isn't difficult to dissociate one's feelings from a mere printed litany of frightfulness. It's easy to convince oneself that things can't really be that terrible, that the horror I allude to is being overblown, that what is going on elsewhere in space-time is somehow less real than the here-and-now, or that the good in the world somehow offsets the bad. Yet however vividly one thinks one can imagine what agony, torture or suicidal despair must be like, the reality is inconceivably worse. The force of \"inconceivably\" is itself largely inconceivable here. Blurry images of Orwell's \"Room 101\" can barely even hint at what I'm talking about. Even if one's ancestral namesakes [aka \"younger self\"] underwent great pain, then the state-dependence of memories means that much of pain's sheer dreadfulness is semantically, cognitively and emotionally inaccessible in the here-and-now.",
      "source": "The Hedonistic Imperative",
      "author": "David Pearce",
      "tags": ["suffering", "horror", "psychedelic"]
    },
    {
      "quote": "It's not that there are no differences between human and non-human animals, any more than there are no differences between black people and white people, freeborn citizens and slaves, men and women, Jews and gentiles, gays or heterosexuals. The question is rather: are they morally relevant differences? This matters because morally catastrophic consequences can ensue when we latch on to a real but morally irrelevant difference between sentient beings.",
      "source": "The Abolitionist Project",
      "author": "David Pearce",
      "tags": ["ethics", "vegan", "discrimination", "antispeciesism"]
    },
    {
      "quote": "If possessing a higher degree of intelligence does not entitle one human to use another for his or her own ends, how can it entitle humans to exploit non-humans?",
      "source": "Animal Liberation",
      "author": "Peter Singer",
      "tags": ["ethics", "vegan", "discrimination", "antispeciesism"]
    },
    {
      "quote": "[B]oth natural selection and the historical record offer powerful reasons for doubting the trustworthiness of our naive moral intuitions. So the possibility that human civilisation might be founded upon some monstrous evil should be taken seriously - even if the possibility seems transparently absurd at the time.",
      "source": "The Antispeciesist Revolution",
      "author": "David Pearce",
      "tags": ["ethics", "vegan", "evolution", "history"]
    },
    {
      "quote": "When one is gripped by excruciating physical pain, one is always shocked at just how frightful it can be.",
      "source": "The Abolitionist Project",
      "author": "David Pearce",
      "tags": ["suffering", "pain", "psychedelic"]
    },
    {
      "quote": "[A marketing orientation in evolution] puts courtship at the heart of modern biology, as marketing is at the heart of modern business.",
      "source": "The Mating Mind: How Sexual Choice Shaped the Evolution of Human Nature",
      "author": "Geoffrey Miller",
      "tags": ["evolution", "science", "analogy", "animals"]
    },
    {
      "quote": "A computer cannot realise a solution of the Navier-Stokes equations in which the solution variables refer to atmospheric pressure, velocity, density etc. because a computer does not possess these quantities. A computer can only represent variables such as atmospheric pressure.",
      "source": "Universe creation on a computer",
      "author": "Gordon McCabe",
      "tags": ["AI", "computer science", "simulation"]
    },
    {
      "quote": "One should be wary of assuming that we're the folk who can properly look after ourselves, whereas our descendants, if they become genetically pre-programmed ecstatics, will get trapped in robot-serviced states of infantile dependence. For it shouldn't be forgotten that exuberantly happy people also have a fierce will to survive. They love life dearly. They take on daunting challenges against seemingly impossible odds. One of the hallmarks of many endogenous depressive states, on the other hand, is so-called behavioural despair. If one learns that apparently no amount of effort can rescue one from an aversive stimulus, then one tends to sink into a lethargic stupor. This syndrome of \"learned helplessness\" may persist even when the opportunity to escape from the nasty stimulus subsequently arises.",
      "source": "The Hedonistic Imperative",
      "author": "David Pearce",
      "tags": ["suffering", "transhumanism", "future"]
    },
    {
      "quote": "[A] good estimate is an estimate that provides a clear enough view of the project reality to allow the project leadership to make good decisions about how to control the project to hit its targets.",
      "source": "Software Estimation: Demystifying the Black Art",
      "author": "Steve McConnell",
      "tags": ["software engineering", "management", "business"]
    },
    {
      "quote": "A man generally has two reasons for doing a thing; one that sounds good, and a real one.",
      "author": "John Pierpont Morgan",
      "tags": ["rationalisation", "short"]
    },
    {
      "quote": "[A] recursive definition (when properly formulated) never leads to infinite regress or paradox. This is because a recursive definition never defines something in terms of itself, but always in terms of simpler versions of itself.",
      "source": "Gödel, Escher, Bach: An Eternal Golden Braid",
      "author": "Douglas Hofstadter",
      "tags": ["mathematics", "recursion", "paradox"]
    },
    {
      "quote": "[T]rue hedonic engineering, as distinct from mindless hedonism or reckless personal experimentation, can be profoundly good for our character. Character-building technologies can benefit utilitarians and non-utilitarians alike. Potentially, we can use a convergence of biotech, nanorobotics and information technology to gain control over our emotions and become better (post-)human beings, to cultivate the virtues, strength of character, decency, to become kinder, friendlier, more compassionate: to become the type of (post)human beings that we might aspire to be, but aren't, and biologically couldn't be, with the neural machinery of unenriched minds. Given our Darwinian biology, too many forms of admirable behaviour simply aren't rewarding enough for us to practise them consistently: our second-order desires to live better lives as better people are often feeble echoes of our baser passions.",
      "source": "Utopian Neuroscience",
      "author": "David Pearce",
      "tags": ["altruism", "transhumanism", "future", "paradise engineering", "science"]
    },
    {
      "quote": "[M]en are only as good as their technical development allows them to be.",
      "source": "Charles Dickens",
      "author": "George Orwell",
      "tags": ["transhumanism", "technology", "nature"]
    },
    {
      "quote": "If liberty means anything at all, it means the right to tell people what they do not want to hear.",
      "source": "Animal Farm",
      "author": "George Orwell",
      "tags": ["liberty", "freedom", "offense", "short"]
    },
    {
      "quote": "We can interpret any piece of matter as being conscious if we want to, but in many cases it doesn't make sense to most of us to speak that way. Panpsychism is analogous to \"pantableism\" -- the view that tableness is intrinsic to all matter. There is some sense in which you can interpret any piece of matter as being a table. After all, for any (solid) clump of atoms, you can put stuff on it, and it can support the things that it holds. But this definition is really a stretch for most objects. So it is with saying that everything is conscious.",
      "source": "Dissolving Confusion about Consciousness",
      "author": "Brian Tomasik",
      "tags": ["consciousness", "panpsychism", "analogy"]
    },
    {
      "quote": "In a triumph of aestheticism over morality, many animal lovers otherwise sympathetic to the sentiments expressed here will doubtless be aghast at the very idea of losing such lovable companions and time-honoured killers as members of the cat family; but then they are unlikely to be hunted down in terror or physically eaten alive, which lends a rather different perspective to any issue at all.",
      "source": "The Taste Of Depravity",
      "author": "David Pearce",
      "tags": ["ethics", "nature", "cats", "predation", "suffering"]
    },
    {
      "who": "Richard Noonan",
      "quote": "[A] person needs money in order to never think about them.",
      "source": "Roadside Picnic",
      "author": "Arkady Strugatsky, Boris Strugatsky",
      "tags": ["money", "short"]
    },
    {
      "quote": "[I]nstead of trying to ensure that humanity survives, we should prioritize making the future less bad, in case it will contain sentient life.",
      "source": "How Could an Empty World Be Better than a Populated One?",
      "author": "Simon Knutsson",
      "tags": ["ethics", "future", "suffering", "s-risks", "x-risks", "effective altruism"]
    },
    {
      "quote": "[T]here's no forces stopping us from making [the world] better, from fixing it; and the only thing stopping us is the fact that we don't have right ideas in people's [...] heads.",
      "source": "Knowledge, Intelligence, Wisdom....just do it.",
      "author": "inmendham",
      "tags": ["politics", "ideas", "philosophy"]
    },
    {
      "quote": "The question is not Can they reason?, nor Can they talk?, but Can they suffer?",
      "source": "An Introduction to the Principles of Morals and Legislation",
      "author": "Jeremy Bentham",
      "tags": ["suffering", "animals", "ethics"]
    },
    {
      "quote": "AI researchers have devoted little effort to passing the Turing Test, believing that it is more important to study the underlying principles of intelligence than to duplicate an exemplar. The quest for \"artificial flight\" succeeded when the Wright brothers and others stopped imitating birds and started using wind tunnels and learning about aerodynamics. Aeronautical engineering texts do not define the goal of their field as making \"machines that fly so exactly like pigeons that they can fool even other pigeons.\"",
      "source": "Artificial Intelligence: A Modern Approach",
      "author": "Stuart Russell, Peter Norvig",
      "tags": ["AI", "science", "analogy"]
    },
    {
      "quote": "[W]hat special competence does a priest, rabbi, or imam have to judge the ethical implications of embryonic stem-cell research, family planning, or preventative war? The truth is that a person’s knowledge of a scriptural tradition is no more relevant to ethics than it is to astronomy.",
      "source": "Letter to a Christian Nation",
      "author": "Sam Harris",
      "tags": ["religion", "ethics", "atheism"]
    },
    {
      "quote": "Choosing beliefs freely is not what rational minds do.",
      "source": "The Moral Landscape: How Science Can Determine Human Values",
      "author": "Sam Harris",
      "tags": ["religion", "rationality", "skepticism", "short", "atheism"]
    },
    {
      "quote": "Consciousness has to be something, and it's not any stranger for it to be certain physical operations than for it to be anything else.",
      "source": "Dissolving Confusion about Consciousness",
      "author": "Brian Tomasik",
      "tags": ["consciousness"]
    },
    {
      "quote": "Constraints are often advantages in disguise. Forget about venture capital, long release cycles, and quick hires. Instead, work with what you have.",
      "source": "Getting Real: The Smarter, Faster, Easier Way to Build a Web Application",
      "author": "37signals",
      "tags": ["advice", "startup", "business"]
    },
    {
      "quote": "Do not be too moral. You may cheat yourself out of much life so. Aim above morality. Be not simply good, be good for something.",
      "author": "Henry David Thoreau",
      "tags": ["utilitarianism", "ethics", "religion", "secularism"]
    },
    {
      "quote": "Every piece of knowledge must have a single, unambiguous, authoritative representation within a system.",
      "source": "The Pragmatic Programmer",
      "author": "Andy Hunt, Dave Thomas",
      "tags": ["programming", "software engineering"]
    },
    {
      "quote": "Y'all talk about UX like it's just another feature. For a user, it literally is the product. Full stop. Everything else is inside baseball.",
      "source": "https://twitter.com/startupljackson/status/523539069444177920?lang=en",
      "author": "Startup L. Jackson",
      "tags": ["UX", "startup", "product"]
    },
    {
      "quote": "You will satisfy your interests better if you talk about where you would like to go rather than about where you have come from. Instead of arguing with the other side about the past — about last quarter's costs (which were too high), last week's action (taken without adequate authority), or yesterday's performance (which was less than expected) — talk about what you want to have happen in the future. Instead of asking them to justify what they did yesterday, ask, \"Who should do what tomorrow?\"",
      "source": "Getting to Yes: Negotiating Agreement Without Giving In",
      "author": "William Ury, Roger Fisher",
      "tags": ["negotiation", "business", "politics"]
    },
    {
      "quote": "You cannot take a photo any faster by assigning more photographers. You cannot deliver a speech any quicker by adding more speakers. After a construction site is fi lled with workers, you cannot add any more and hope to increase productivity; they will trip over each other and progress will slow down.",
      "source": "Ace the Programming Interview: 160 Questions and Answers for Success",
      "author": "Edward Guiness",
      "tags": ["productivity", "startup", "analogy", "business", "software engineering"]
    },
    {
      "quote": "Where two or more tools can perform the same task, choose the one that allows for the most valuable work to be done per unit time.",
      "source": "Information Visualization: Perception for Design",
      "author": "Colin Ware",
      "tags": ["productivity", "advice", "utilitarianism", "software engineering", "short"]
    },
    {
      "quote": "When you're asked to provide an estimate, determine whether you're supposed to be estimating or figuring out how to hit a target.",
      "source": "Software Estimation: Demystifying the Black Art",
      "author": "Steve McConnell",
      "tags": ["startup", "advice", "business", "software engineering", "short"]
    },
    {
      "quote": "When one is gripped by excruciating physical pain, one is always shocked at just how frightful it can be.",
      "source": "The Abolitionist Project",
      "author": "David Pearce",
      "tags": ["suffering", "pain", "ethics", "short"]
    },
    {
      "quote": "When it comes to the growth of the size of problems we can attack with an algorithm, we have a reversal: exponential algorithms make polynomially slow progress, while polynomial algorithms advance exponentially fast! For Moore's law to be reflected in the world we need efficient algorithms.",
      "source": "Algorithms",
      "author": "Christos Papadimitriou, Sanjoy Dasgupta, Umesh Vazirani",
      "tags": ["algorithms", "Moore's law", "technology", "progress", "computer science"]
    },
    {
      "quote": "When in doubt, use brute force.",
      "author": "Ken Thompson",
      "tags": ["algorithms", "advice", "programming", "computer science", "heuristic", "short"]
    },
    {
      "quote": "When are you done? Since design is open-ended, the most common answer to that question is \"When you’re out of time.\"",
      "source": "Code Complete",
      "author": "Steve McConnell",
      "tags": ["design", "software engineering", "startup", "UX"]
    },
    {
      "quote": "When a word poses a problem, the simplest solution is to eliminate the word and its synonyms.",
      "source": "Rationality: From AI to Zombies",
      "author": "Eliezer Yudkowsky",
      "tags": ["advice", "rationality", "argument", "short"]
    },
    {
      "quote": "When a measure becomes a target, it ceases to be a good measure.",
      "author": "Marilyn Strathern",
      "tags": ["management", "startup", "science", "short", "rule"]
    },
    {
      "quote": "We're always changing boundaries! Where does an elbow start or end? When does a youth become an adult? Where does an ocean change into a sea? Why must our minds keep drawing lines to structure our reality? The answer is that unless we made those mind-constructed boundaries, we'd never see any thing at all! This is because we rarely see anything twice as exactly the same. Each time we're almost certain to be looking from a somewhat different view, perhaps from nearer or farther, higher or lower, in a different color or shade of light, or against a different background.",
      "source": "Society Of Mind",
      "author": "Marvin Minsky",
      "tags": ["AI", "consciousness"]
    },
    {
      "quote": "We seek a pattern, and we find one.",
      "source": "The Demon-Haunted World: Science as a Candle in the Dark",
      "author": "Carl Sagan",
      "tags": ["bias", "consciousness", "rationality", "short"]
    },
    {
      "quote": "We cannot, of course, disprove God, just as we can't disprove Thor, fairies, leprechauns and the Flying Spaghetti Monster.",
      "source": "Why There Almost Certainly Is No God",
      "author": "Richard Dawkins",
      "tags": ["god", "rationality", "science", "atheism"]
    },
    {
      "quote": "We are all atheists about most of the gods that societies have ever believed in. Some of us just go one god further.",
      "source": "The God Delusion",
      "author": "Richard Dawkins",
      "tags": ["god", "atheism"]
    },
    {
      "quote": "We are all flawed and creatures of our times.",
      "source": "The Demon-Haunted World: Science as a Candle in the Dark",
      "author": "Carl Sagan",
      "tags": ["ethics", "short", "humans"]
    },
    {
      "quote": "[U]nlike positive utilitarianism or so-called preference utilitarianism - neither of which can ever be wholly fulfilled - [negative utilitarianism] seems achievable in full.",
      "source": "The Pinprick Argument",
      "author": "David Pearce",
      "tags": ["utilitarianism", "philosophy"]
    },
    {
      "quote": "Unexplained does not mean inexplicable.",
      "tags": ["short", "science"]
    },
    {
      "quote": "Understanding our own case involves seeing how we fit into the total picture of biological evolution and its products, including other possible systems on other planets, and also in future robots. It is important to pursue this idea without assuming that states of consciousness of other animals can be expressed in our language. E.g. ‘the deer sees the lion approaching’ may be inappropriate if it implies that the deer uses something like our concepts of \"lion\" and \"approaching\". We must allow for the existence of forms of experience that we cannot describe.",
      "source": "Virtual Machines and Consciousness",
      "author": "Aaron Sloman, Ron Chrisley",
      "tags": ["evolution", "AI", "consciousness"]
    },
    {
      "quote": "Too many of our preferences reflect nasty behaviours and states of mind that were genetically adaptive in the ancestral environment. Instead, wouldn't it be better if we rewrote our own corrupt code?",
      "source": "The Abolitionist Project",
      "author": "David Pearce",
      "tags": ["evolution", "ethics", "future", "humans", "paradise engineering", "transhumanism"]
    },
    {
      "quote": "To be clear, most people who believe in the end-times narratives of their ancient holy texts are passive spectators of the apocalypse. But at the statistical margins are what we might call eschatological activists intent on fulfilling prophecy themselves. Such individuals are the exception, not the rule, but this fact will become increasingly irrelevant in the world anticipated by existential riskologists.",
      "source": "To Survive, We Must Go Extinct — Apocalyptic Terrorism and Transhumanism",
      "author": "Phil Torres",
      "tags": ["x-risks", "religion", "future", "apocalypse"]
    },
    {
      "quote": "There is no great invention, from fire to flying, which has not been hailed as an insult to some god.",
      "source": "Daedalus; or, Science and the Future",
      "author": "John Burdon Sanderson Haldane",
      "tags": ["atheism", "religion", "god", "technology", "science", "short"]
    },
    {
      "quote": "There are two ways of constructing a software design: one way is to make it so simple that there are obviously no deficiencies, and the other is to make it so complicated that there are no obvious deficiencies.",
      "author": "Tony Hoare",
      "tags": ["programming", "software engineering"]
    },
    {
      "quote": "There are two different aspects to a reminder: the signal and the message. Just as in doing an action we can distinguish between knowing what can be done and knowing how to do it, in reminding we must distinguish between the signal—knowing that something is to be remembered, and the message—remembering the information itself.",
      "source": "The Design of Everyday Things",
      "author": "Don Norman",
      "tags": ["design", "UX"]
    },
    {
      "quote": "The very fact that a religious person would be afraid of God withdrawing Its threat to punish them for committing murder, shows that they have a revulsion of murder which is independent of whether God punishes murder or not.  If they had no sense that murder was wrong independently of divine retribution, the prospect of God not punishing murder would be no more existentially horrifying than the prospect of God not punishing sneezing.",
      "source": "Rationality: From AI to Zombies",
      "author": "Eliezer Yudkowsky",
      "tags": ["religion", "atheism", "god", "morality", "rationality"]
    },
    {
      "quote": "The theory of evolution by cumulative natural selection is the only theory we know of that is in principle capable of explaining the existence of organized complexity.",
      "source": "The Blind Watchmaker",
      "author": "Richard Dawkins",
      "tags": ["evolution", "science", "short", "god"]
    },
    {
      "quote": "The reason you negotiate is to produce something better than the results you can obtain without negotiating. What are those results? What is that alternative? What is your BATNA—your Best Alternative To a Negotiated Agreement? That is the standard against which any proposed agreement should be measured. That is the only standard that can protect you both from accepting terms that are too unfavorable and from rejecting terms it would be in your interest to accept.",
      "source": "Getting to Yes: Negotiating Agreement Without Giving In",
      "author": "Roger Fisher, William L. Ury",
      "tags": ["negotiating", "business"]
    },
    {
      "quote": "The pitfall to this \"safety-first\" approach lies in the extreme risk of moral complacency it breeds. Hundreds of millions of human beings, and billions of non-human animals, are not in such a fortunate position. On a universalist utilitarian ethic, or simply a Buddhist-style ethic of compassion, we should systematically apply the same level of urgency to relieving their suffering as one would be justified in exercising if one were oneself tormented by intense pain or suicidal despair. Extreme suffering is the plight of billions of sentient beings alive today, whether in our factory-farms, in a Darwinian state of nature, or a depressed neighbour. Desperate straits mandate taking risks one would otherwise shun.",
      "source": "The Hedonistic Imperative",
      "author": "David Pearce",
      "tags": ["suffering", "transhumanism", "paradise engineering", "ethics", "nature"]
    },
    {
      "quote": "The ocean of male language that confronts modern women in bookstores, television, newspapers, classrooms, parliaments, and businesses does not necessarily come from a male conspiracy to deny women their voice. It may come from an evolutionary history of sexual selection in which the male motivation to talk was vital to their reproduction.",
      "source": "The Mating Mind: How Sexual Choice Shaped the Evolution of Human Nature",
      "author": "Geoffrey Miller",
      "tags": ["evolution", "society", "males", "humans"]
    },
    {
      "quote": "[T]he pain-pleasure axis discloses the world's inbuilt metric of (dis)value, and that acting unethically ultimately is a function of ignorance – ignorance, I would add, about what others feel, and about our not being fundamentally different from others.",
      "source": "My Disagreements with Brian Tomasik",
      "author": "Magnus Vinding",
      "tags": ["suffering", "ethics"]
    },
    {
      "quote": "The most profound technologies are those that disappear. They weave themselves into the fabric of everyday life until they are indistinguishable from it.",
      "source": "The Computer for the 21st Century",
      "author": "Mark Weiser",
      "tags": ["technology", "society"]
    },
    {
      "quote": "The life of a designer is a life of fight: fight against the ugliness.",
      "source": "Helvetica",
      "author": "Massimo Vignelli",
      "tags": ["design", "short"]
    },
    {
      "quote": "The first thing to learn in intercourse with others is noninterference with their own peculiar ways of being happy, provided those ways do not assume to interfere by violence with ours.",
      "author": "William James",
      "tags": ["humans", "society"]
    },
    {
      "quote": "The fact that one can lose one's sense of self in an ocean of tranquility does not mean that one's consciousness is immaterial or that it presided over the birth of the universe.",
      "source": "On Spiritual Truths",
      "author": "Sam Harris",
      "tags": ["atheism", "consciousness", "skepticism"]
    },
    {
      "quote": "The fact that a program can find a solution in principle does not mean that the program contains any of the mechanisms needed to find it in practice.",
      "tags": ["programming", "short", "software engineering"]
    },
    {
      "quote": "The critical attitude may be described as the conscious attempt to make our theories, our conjectures, suffer in our stead in the struggle for the survival of the fittest. It gives us a chance to survive the elimination of an inadequate hypothesis — when a more dogmatic attitude would eliminate it by eliminating us.",
      "source": "Conjectures and Refutations",
      "author": "Karl Popper",
      "tags": ["rationality", "science", "skepticism"]
    },
    {
      "quote": "The anti-work of anti-epistemology is to manufacture belief without evidence, and in large answer spaces, attention without evidence is more than halfway to belief without evidence. Someone who spends all day pondering whether the Trinity does or does not exist - rather than Allah, Thor, or the Flying Spaghetti Monster - is more than halfway converted to Christianity.",
      "tags": ["rationality", "science", "skepticism", "religion", "god"]
    }
  ]
}
